// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   LoadStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell load command
// 
// Revision History:
//  
// --*/

/=#

#langdef   eng "English"

#string STR_LOAD_IMAGE_NOT_DRIVER      #language eng  "%Hload%N: Image %hs is not a driver\n"

#string STR_LOAD_IMAGE_LOADED          #language eng  "%Hload%N: Image %hs loaded at %x - %r\n"

#string STR_LOAD_IMAGE_ERROR           #language eng  "%Hload%N: Image %hs error - %r\n"

#string STR_LOAD_NOT_IMAGE             #language eng  "%Hload%N: %hs is not a image\n"

#string STR_LOAD_LINE_HELP             #language eng  "Loads and optionally connected EFI drivers"

#string STR_LOAD_VERBOSE_HELP          #language eng  "Loads EFI drivers and then they can provide available services.\n"
                                                      "\n"
                                                      "LOAD [-nc] file [file...]\n"
                                                      "\n"
                                                      "    -nc     - Load the driver, but do not connect the driver.\n"
                                                      "    file    - File that contains the image of the EFI driver (wildcards are\n"
                                                      "              permitted)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. LOAD can deal with multiple files and supports wildcards.\n"
                                                      "    2. Use 'UNLOAD' command to unload a driver if it supports unloading.\n"
                                                      "    3. If option -nc is not specified, then the loaded drivers will be\n"
                                                      "       automatically connected. If -nc is specified, then none of the loaded\n"
                                                      "       drivers will be connected. Loading without -nc could cause\n"
                                                      "       the previously loaded drivers to be connected. This is not a bug, and\n"
                                                      "       it complies with the EFI Specification.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    fs0:\\> load Isabus.efi\n"
                                                      "    load: Image 'fs0:\\Isabus.efi' loaded at 18FE000 - Success\n"
                                                      "\n"     
                                                      "    fs0:\\> load Isabus.efi IsaSerial.efi\n"
                                                      "    load: Image 'fs0:\\Isabus.efi' loaded at 18E5000 - Success\n"
                                                      "    load: Image 'fs0:\\IsaSerial.efi' loaded at 18DC000 - Success\n"
                                                      "\n"    
                                                      "    fs0:\\> load Isa*.efi\n"
                                                      "    load: Image 'fs0:\\IsaBus.efi' loaded at 18D4000 - Success\n"
                                                      "    load: Image 'fs0:\\IsaSerial.efi' loaded at 18CB000 - Success\n"
                                                      "\n"
                                                      "    fs0:\\> load -nc IsaBus.efi\n"
                                                      "    load: Image 'fs0:\\Isabus.efi' loaded at 18FE000 - Success\n"
